In [22]:
import pandas as pd
import numpy as np

In [23]:
my_table = pd.read_csv("airtravel.csv")
my_table

   Month   "1958"   "1959"   "1960"
0    JAN      340      360      417
1    FEB      318      342      391
2    MAR      362      406      419
3    APR      348      396      461
4    MAY      363      420      472
5    JUN      435      472      535
6    JUL      491      548      622
7    AUG      505      559      606
8    SEP      404      463      508
9    OCT      359      407      461
10   NOV      310      362      390
11   DEC      337      405      432

In [24]:
# Get first 5 row
my_table.head()

  Month   "1958"   "1959"   "1960"
0   JAN      340      360      417
1   FEB      318      342      391
2   MAR      362      406      419
3   APR      348      396      461
4   MAY      363      420      472

In [25]:
# Get first n rows
my_table.head(5)

  Month   "1958"   "1959"   "1960"
0   JAN      340      360      417
1   FEB      318      342      391
2   MAR      362      406      419
3   APR      348      396      461
4   MAY      363      420      472

In [26]:
# Get last 5 rows
my_table.tail()

   Month   "1958"   "1959"   "1960"
7    AUG      505      559      606
8    SEP      404      463      508
9    OCT      359      407      461
10   NOV      310      362      390
11   DEC      337      405      432

In [27]:
# Get last n rows
my_table.tail(2)

   Month   "1958"   "1959"   "1960"
10   NOV      310      362      390
11   DEC      337      405      432

In [28]:
# Get info on the datafrane
my_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Month    12 non-null     object
 1    "1958"  12 non-null     int64
 2    "1959"  12 non-null     int64
 3    "1960"  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 516.0+ bytes

In [29]:
# Get shape
my_table.shape

(12, 4)

In [30]:
# Get dimensions
my_table.ndim

2

In [31]:
# Get column types
my_table.dtypes

Month      object
 "1958"     int64
 "1959"     int64
 "1960"     int64
dtype: object

In [32]:
# Get statsistics about the data
my_table.describe()

           "1958"      "1959"      "1960"
count   12.000000   12.000000   12.000000
mean   381.000000  428.333333  476.166667
std     64.530472   69.830097   77.737125
min    310.000000  342.000000  390.000000
25%    339.250000  387.500000  418.500000
50%    360.500000  406.500000  461.000000
75%    411.750000  465.250000  514.750000
max    505.000000  559.000000  622.000000

In [33]:
# Desribe a column
my_table["Month"].describe()

count      12
unique     12
top       JAN
freq        1
Name: Month, dtype: object

In [34]:
# Select a column
my_table[" \"1958\""]

0     340
1     318
2     362
3     348
4     363
5     435
6     491
7     505
8     404
9     359
10    310
11    337
Name:  "1958", dtype: int64

In [36]:
# Select column by location
my_table.iloc[[2, 3]]

  Month   "1958"   "1959"   "1960"
2   MAR      362      406      419
3   APR      348      396      461